Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзятыеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.СредстваНаСкладе</xr:Item>
				<xr:Item>AccumulationRegister.СредстваУСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИОЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧатИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/MobileConnect/Ext/Module.bsl
Функция ОбновитьЗаказы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка,
		|	Заказы.ФИОЗаказчика КАК ФИОЗаказчика,
		|	Заказы.Адрес КАК Адрес,
		|	Заказы.СтатусЗаказа КАК СтатусЗаказа,
		|	Заказы.ПлощадьПомещения КАК ПлощадьПомещения,
		|	Заказы.ФИОСотрудника КАК ФИОСотрудника,
		|	Заказы.ВремяОкончанияЗаказа КАК ВремяОкончанияЗаказа,
		|	Заказы.СтатусСотрудника КАК СтатусСотрудника,
		|	Заказы.Номер КАК Номер
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.Заказы КАК Заказы
		|ГДЕ
		|	Заказы.ПометкаУдаления = &Ложь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Ссылка КАК Ссылка,
		|	ВременнаяТаблица.ФИОЗаказчика КАК ФИОЗаказчика,
		|	ВременнаяТаблица.Адрес КАК Адрес,
		|	ВременнаяТаблица.СтатусЗаказа КАК СтатусЗаказа,
		|	ВременнаяТаблица.ПлощадьПомещения КАК ПлощадьПомещения,
		|	ВременнаяТаблица.ФИОСотрудника КАК ФИОСотрудника,
		|	ВременнаяТаблица.ВремяОкончанияЗаказа КАК ВремяОкончанияЗаказа,
		|	ВременнаяТаблица.СтатусСотрудника КАК СтатусСотрудника,
		|	ЗаказыУслуги.Услуга КАК Услуга,
		|	ЗаказыУслуги.Цена КАК Цена,
		|	ВременнаяТаблица.Номер КАК Номер
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы.Услуги КАК ЗаказыУслуги
		|		ПО ВременнаяТаблица.Ссылка = ЗаказыУслуги.Ссылка
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ложь", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ТаблДоки = Новый ТаблицаЗначений;
	
	ТаблДоки.Колонки.Добавить("Ссылка");
	ТаблДоки.Колонки.Добавить("Номер");
	ТаблДоки.Колонки.Добавить("ФИОЗаказчика");
	ТаблДоки.Колонки.Добавить("Адрес");
	ТаблДоки.Колонки.Добавить("СтатусЗаказа");
	ТаблДоки.Колонки.Добавить("ПлощадьПомещения");
	ТаблДоки.Колонки.Добавить("ФИОСотрудника");
	ТаблДоки.Колонки.Добавить("ВремяОкончанияЗаказа");
	ТаблДоки.Колонки.Добавить("СтатусСотрудника");
	
	Пока ВыборкаСсылка.Следующий() Цикл
		Док =  ТаблДоки.Добавить();
		Док.Ссылка = XMLСтрока(ВыборкаСсылка.Ссылка);
		
		ТаблицаДока = Новый ТаблицаЗначений;
		
		ТаблицаДока.Колонки.Добавить("Услуга");
		ТаблицаДока.Колонки.Добавить("УслугаГуид");
		ТаблицаДока.Колонки.Добавить("Цена");
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Док.Номер					= ВыборкаДетальныеЗаписи.номер;
			Док.ФИОЗаказчика			= ВыборкаДетальныеЗаписи.ФИОЗаказчика;
			Док.Адрес					= ВыборкаДетальныеЗаписи.Адрес;
			Док.СтатусЗаказа			= ВыборкаДетальныеЗаписи.СтатусЗаказа;
			Док.ПлощадьПомещения		= ВыборкаДетальныеЗаписи.ПлощадьПомещения; 
			Док.ФИОСотрудника			= ВыборкаДетальныеЗаписи.ФИОСотрудника;
			Док.ВремяОкончанияЗаказа	= ВыборкаДетальныеЗаписи.ВремяОкончанияЗаказа;
			Док.СтатусСотрудника		= ВыборкаДетальныеЗаписи.СтатусСотрудника;
			
			СтрДока = ТаблицаДока.Добавить();
			СтрДока.Услуга 		= ВыборкаДетальныеЗаписи.Услуга;
			СтрДока.УслугаГуид	= XMLСтрока(ВыборкаДетальныеЗаписи.Услуга);
			СтрДока.Цена		= ВыборкаДетальныеЗаписи.Цена;
			
		КонецЦикла;
		Док.Таблица =  ТаблицаДока;
	КонецЦикла;
	Возврат Новый ХранилищеЗначения(ТаблДоки);
КонецФункции
